Problem 1: Data Loading and Initial Inspection
Your first step is to load the provided CSV file into a Pandas DataFrame and perform an initial check to ensure the data is loaded correctly. This is a crucial first step in any data analysis workflow.

Write Python code to:

Load the sales_data.csv file into a DataFrame.
Display the first 5 rows to get a quick look at the data structure.
Display the last 5 rows to see the end of the data.
Print a concise summary of the DataFrame, including the data types of each column and the number of non-null values.

In [1]:
import pandas as pd
file=pd.read_csv('sales_data.csv')
df=pd.DataFrame(file)
df.head()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
0,101,Aarav,PROD004,Pistachio Delight,2,152.0,2025-07-01,304
1,102,Siya,PROD004,Strawberry Swirl,3,193.0,2025-07-02,579
2,103,Kiran,PROD004,Strawberry Swirl,4,226.0,2025-07-03,904
3,104,Priya,PROD001,Chocolate Chip,1,138.0,2025-07-04,138
4,105,Mohan,PROD004,Strawberry Swirl,1,177.0,2025-07-05,177

In [2]:
df.tail()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
95,196,Aarav,PROD002,Strawberry Swirl,2,228.0,2025-10-04,456
96,197,Siya,PROD001,Strawberry Swirl,1,139.0,2025-10-05,139
97,198,Kiran,PROD002,Pistachio Delight,3,157.0,2025-10-06,471
98,199,Priya,PROD003,Pistachio Delight,3,92.0,2025-10-07,276
99,200,Mohan,PROD005,Vanilla Dream,2,242.0,2025-10-08,484

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         100 non-null    int64
 1   customer_name    98 non-null     object
 2   product_id       100 non-null    object
 3   product_name     100 non-null    object
 4   quantity         100 non-null    int64
 5   unit_price_inr   95 non-null     float64
 6   order_date       100 non-null    object
 7   total_price_inr  100 non-null    int64
dtypes: float64(1), int64(3), object(4)
memory usage: 6.4+ KB

### Problem 2: Basic Descriptive Analysis

Ms. Kavita wants to get a general overview of the dataset. Use basic Pandas functions to get a high-level summary of the data.

Write Python code to:

* Calculate the total number of orders.
* Find the total quantity of products sold.
* Calculate the total revenue (sum of 'total_price_inr').
* Find the number of unique products sold.
* Determine how many times each unique product was sold.

In [4]:
#Calculate the total number of orders.
df.index
# so the total number of orders are 100

RangeIndex(start=0, stop=100, step=1)

In [5]:
#Find the total quantity of products sold.
print(df["quantity"].sum())

273

In [6]:
#Calculate the total revenue (sum of 'total_price_inr').
print(df["total_price_inr"].sum())

43585

In [7]:
#Find the number of unique products sold.
print(df["product_name"].nunique())

5

In [8]:
#Determine how many times each unique product was sold.
sold=df.groupby(["product_id","product_name"])["quantity"].sum()
sold

product_id  product_name
PROD001     Chocolate Chip        6
            Mango Medley         14
            Pistachio Delight     8
            Strawberry Swirl     15
            Vanilla Dream        14
PROD002     Chocolate Chip        8
            Pistachio Delight    13
            Strawberry Swirl      8
            Vanilla Dream        16
PROD003     Chocolate Chip        6
            Mango Medley         11
            Pistachio Delight    11
            Strawberry Swirl      4
            Vanilla Dream         7
PROD004     Chocolate Chip       16
            Mango Medley         10
            Pistachio Delight     8
            Strawberry Swirl     22
            Vanilla Dream        11
PROD005     Chocolate Chip       11
            Mango Medley          9
            Pistachio Delight     7
            Strawberry Swirl     27
            Vanilla Dream        11
Name: quantity, dtype: int64

### Problem 3: Answering Specific Business Questions with Filtering and Grouping

Ms. Kavita has some specific questions about her operations. Use filtering and grouping techniques to find the answers.

Write Python code to:

* Filter the DataFrame to show all orders made by 'Aarav'.
* Find the total revenue from 'Aarav's orders.
* Identify the product that generated the most revenue.
* Calculate the average order value for each unique customer.
* Sort the data to show the top 5 orders by revenue, from highest to lowest.

In [9]:
df.head()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
0,101,Aarav,PROD004,Pistachio Delight,2,152.0,2025-07-01,304
1,102,Siya,PROD004,Strawberry Swirl,3,193.0,2025-07-02,579
2,103,Kiran,PROD004,Strawberry Swirl,4,226.0,2025-07-03,904
3,104,Priya,PROD001,Chocolate Chip,1,138.0,2025-07-04,138
4,105,Mohan,PROD004,Strawberry Swirl,1,177.0,2025-07-05,177

In [10]:
#Filter the DataFrame to show all orders made by 'Aarav'.
arav_data=df.loc[(df["customer_name"]=="Aarav")]
arav_data.head()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
0,101,Aarav,PROD004,Pistachio Delight,2,152.0,2025-07-01,304
5,106,Aarav,PROD002,Vanilla Dream,1,229.0,2025-07-06,229
15,116,Aarav,PROD005,Chocolate Chip,2,108.0,2025-07-16,216
20,121,Aarav,PROD001,Pistachio Delight,3,163.0,2025-07-21,489
25,126,Aarav,PROD005,Chocolate Chip,3,160.0,2025-07-26,480

In [11]:
#Find the total revenue from 'Aarav's orders.
total_revenue=arav_data["total_price_inr"].sum()
print("The total revenue from aarav_data is:",total_revenue)

The total revenue from aarav_data is: 8018

In [12]:
# Identify the product that generated the most revenue.
most_revenue=df.groupby("product_name")["total_price_inr"].sum()
most_revenue.head(1)

product_name
Chocolate Chip    6922
Name: total_price_inr, dtype: int64

In [13]:
#Calculate the average order value for each unique customer.
avg_order_value=df.groupby("customer_name")["total_price_inr"].mean()
avg_order_value

customer_name
Aarav    422.000000
Kiran    457.950000
Mohan    466.800000
Priya    478.400000
Siya     345.210526
Name: total_price_inr, dtype: float64

In [14]:
#Sort the data to show the top 5 orders by revenue, from highest to lowest.
top_5_products=df.sort_values(by=["total_price_inr"],ascending=[False])
top_5_products.head()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
78,179,Priya,PROD002,Strawberry Swirl,4,227.0,2025-09-17,908
2,103,Kiran,PROD004,Strawberry Swirl,4,226.0,2025-07-03,904
46,147,Siya,PROD002,Vanilla Dream,4,218.0,2025-08-16,872
8,109,Priya,PROD002,Vanilla Dream,4,211.0,2025-07-09,844
30,131,Aarav,PROD005,Strawberry Swirl,4,209.0,2025-07-31,836

### Problem 4: Combining DataFrames (Concatenation) and Time-Series data

Ms. Kavita has a new dataset representing an additional week of sales data. She also wants to analyze sales trends over time.

Write Python code to:

* Create a new DataFrame for an additional week of sales. Make sure its columns match the original DataFrame.
  The data to be used is presented below :
   `'order_id': ['201', '202', '203'],
    'customer_name': ['Rahul', 'Ananya', 'Aarav'],
    'product_id': ['PROD001', 'PROD005', 'PROD002'],
    'product_name': ['Chocolate Chip', 'Vanilla Dream', 'Mango Medley'],
    'quantity': [2, 3, 1],
    'unit_price_inr': [120, 180, 150],
    'order_date': ['2025-08-01', '2025-08-02', '2025-08-03'],
    'total_price_inr': [240, 540, 150`]
* Concatenate the new DataFrame with the original one.
* Convert the 'order_date' column to a proper datetime format if not already done.
* Calculate the total daily revenue over the entire period.
* Find the day of the week with the highest sales on average.

In [15]:
# Create a new DataFrame for an additional week of sales. Make sure its columns match the original DataFrame.
 # The data to be used is presented below :
df1=pd.DataFrame({'order_id': ['201', '202', '203'],
    'customer_name':['Rahul', 'Ananya', 'Aarav'],
    'product_id': ['PROD001', 'PROD005', 'PROD002'],
    'product_name': ['Chocolate Chip', 'Vanilla Dream', 'Mango Medley'],
    'quantity':[2, 3, 1],
    'unit_price_inr': [120, 180, 150],
    'order_date': ['2025-08-01', '2025-08-02', '2025-08-03'],
    'total_price_inr': [240, 540, 150]
    })
df1

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
0,201,Rahul,PROD001,Chocolate Chip,2,120,2025-08-01,240
1,202,Ananya,PROD005,Vanilla Dream,3,180,2025-08-02,540
2,203,Aarav,PROD002,Mango Medley,1,150,2025-08-03,150

In [16]:
#Concatenate the new DataFrame with the original one.
df.head()
new_data_frame=pd.concat([df,df1],ignore_index=True)
new_data_frame.tail()

,order_id,customer_name,product_id,product_name,quantity,unit_price_inr,order_date,total_price_inr
98,199,Priya,PROD003,Pistachio Delight,3,92.0,2025-10-07,276
99,200,Mohan,PROD005,Vanilla Dream,2,242.0,2025-10-08,484
100,201,Rahul,PROD001,Chocolate Chip,2,120.0,2025-08-01,240
101,202,Ananya,PROD005,Vanilla Dream,3,180.0,2025-08-02,540
102,203,Aarav,PROD002,Mango Medley,1,150.0,2025-08-03,150

In [17]:
#Convert the 'order_date' column to a proper datetime format if not already done.
print("Before date converitng:")
new_data_frame.info()
new_data_frame["order_date"]=pd.to_datetime(new_data_frame["order_date"])
print("*=="*20)
print("After date converting into datetime object:")
new_data_frame.info()

Before date converitng:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103 entries, 0 to 102
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         103 non-null    object
 1   customer_name    101 non-null    object
 2   product_id       103 non-null    object
 3   product_name     103 non-null    object
 4   quantity         103 non-null    int64
 5   unit_price_inr   98 non-null     float64
 6   order_date       103 non-null    object
 7   total_price_inr  103 non-null    int64
dtypes: float64(1), int64(2), object(5)
memory usage: 6.6+ KB
*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==*==
After date converting into datetime object:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103 entries, 0 to 102
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         103 non-null    object
 1   customer_name    101 non-null    object
 2   product_id       103 non-null    object
 3   product_name     103 non-null    object
 4   quantity         103 non-null    int64
 5   unit_price_inr   98 non-null     float64
 6   order_date       103 non-null    datetime64[ns]
 7   total_price_inr  103 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 6.6+ KB

In [18]:
#Calculate the total daily revenue over the entire period.
new_data_frame["order_date"].nunique()
total_daily_revenue=new_data_frame.groupby("order_date")["total_price_inr"].sum()
print("stating value:",total_daily_revenue.head())
print("*==="*20)
print("Ending value:",total_daily_revenue.tail())
print("*==="*20)
total_revenue_entire_period=total_daily_revenue.sum()
print("The total_revenue:",total_revenue_entire_period)

stating value: order_date
2025-07-01    304
2025-07-02    579
2025-07-03    904
2025-07-04    138
2025-07-05    177
Name: total_price_inr, dtype: int64
*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===
Ending value: order_date
2025-10-04    456
2025-10-05    139
2025-10-06    471
2025-10-07    276
2025-10-08    484
Name: total_price_inr, dtype: int64
*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===*===
The total_revenue: 44515

In [19]:
#Find the day of the week with the highest sales on average.
new_data_frame["day"]=new_data_frame["order_date"].dt.day_name()
highest_sales_avg=new_data_frame.groupby("day")["total_price_inr"].mean()
highest_sales_avg.sort_values(ascending=False)

day
Wednesday    551.733333
Thursday     490.785714
Saturday     465.400000
Sunday       455.000000
Monday       383.857143
Friday       350.933333
Tuesday      328.266667
Name: total_price_inr, dtype: float64